Repository: caspermeijn/onvifviewer
Catalog: po/*.po
Languages: de, nb_no, pt, tr

source: View and control network cameras using the ONVIF protocol
de: Netzwerk-Kameras mittels ONTIV-Protokoll ansehen und steuern
nb_no: Se på og kontroller nettverkskameraer som bruker ONVIF-protokollen
pt: Ver e controlar câmeras de rede usando o protocolo ONVIF
tr: ONVIF protokolünü kullanarak ağ kameralarını görüntüleyin ve denetleyin

# NAME OF TRANSLATORS
source: Your names
de: MSC
nb_no: Allan Nordhøy
pt: ssantos
tr: Özgür Karter Oğuz Ersen

# EMAIL OF TRANSLATORS
source: Your emails
nb_no: epost@anotheragency.no
pt: ssantos@web.de
tr: ozgurkarter@gmail.com oguzersen@protonmail.com

source: Main developer
de: Hauptentwickler
nb_no: Hovedutvikler
pt: Principal programador
tr: Ana geliştirici

source: Add demo camera
de: Demokamera hinzufügen
nb_no: Legg til demokamera
pt: Adicionar câmera de demonstração
tr: Demo kamera ekle

source: New manual device
de: Neues manuelles Gerät
nb_no: Ny manuell enhet
pt: Novo aparelho manual
tr: El ile yeni aygıt

source: Device settings
de: Geräteeinstellungen
nb_no: Enhetsinnstillinger
pt: Configurações do aparelho
tr: Aygıt ayarları

source: Connection settings
de: Verbindungseinstellungen
nb_no: Tilkoblingsinnstillinger
pt: Configurações de conexão
tr: Bağlantı ayarları

source: Camera name:
de: Kameraname:
nb_no: Kameranavn:
pt: Nome da câmera:
tr: Kamera adı:

source: e.g. Backyard
de: z. B. Hinterhof
nb_no: f.eks. Bakgård
pt: por exemplo. Jardim
tr: örn: Arka bahçe

source: Hostname:
nb_no: Vertsnavn:
tr: Ana makine adı:

source: e.g. ipcam.local or 192.168.0.12
de: z. B. ipcam.lokal oder 192.168.0.12
nb_no: f.eks. ipcom.local eller 192.168.0.12
pt: por exemplo. ipcam.local ou 192.168.0.12
tr: örn: ipcam.local veya 192.168.0.12

source: Username:
de: Benutzername:
nb_no: Brukernavn:
pt: Nome de utilizador:
tr: Kullanıcı adı:

source: Password:
de: Passwort:
nb_no: Passord:
pt: Palavra-passe:
tr: Parola:

source: Camera properties
de: Kameraeigenschaften
nb_no: Kameraegenskaper
pt: Propriedades da câmera
tr: Kamera özellikleri

source: Enable camera movement fix
de: Kamerabewegungskorrektur aktivieren
nb_no: Skru på kamerabevegelsesfiks
pt: Ativar correção do movimento da câmera
tr: Kamera hareketi düzeltmeyi etkinleştir

source: Remove camera
de: Kamera entfernen
nb_no: Fjern kamera
pt: Remover a câmera
tr: Kamerayı kaldır

source: Camera %1
de: Kamera %1
nb_no: Kamera %1
tr: Kamera %1

# opens pan/tilt/zoom overlay
source: Move
de: Bewegen
nb_no: Flytt
pt: Mover
tr: Hareket

# opens device information overlay
source: Device information
de: Geräteinformation
nb_no: Enhetsinformasjon
pt: Informações do aparelho
tr: Aygıt bilgileri

source: Saving current position as home
de: Aktuelle Position als Basis speichern
nb_no: Lagrer nåværende posisjon som hjem
pt: A gravar a posição atual como Casa
tr: Geçerli konum ana konum olarak kaydediliyor

source: Device information
de: Geräteinformation
nb_no: Enhetsinformasjon
pt: Informações do aparelho
tr: Aygıt bilgileri

source: Manufacturer:
de: Hersteller:
nb_no: Fabrikant:
pt: Fabricante:
tr: Üretici:

source: Firmware version:
nb_no: Fastvareversjon:
pt: Versão do firmware:
tr: Ürün yazılımı sürümü:

source: Serial number:
de: Seriennummer:
nb_no: Serienummer:
pt: Número de série:
tr: Seri numarası:

source: Hardware identifier:
de: Hardwarebezeichner:
nb_no: Maskinvareidentifikator:
pt: Identificador de hardware:
tr: Donanım tanımlayıcısı:

source: This camera is currently only opened as a preview. This means that the device is not loaded the next time you open this application. If you want to save this device, then you need to click the Save button.
de: Diese Kamera ist gegenwärtig nur als Vorschau geöffnet. Das heißt, das Gerät wird beim nächsten Start dieser Anwendung nicht geladen. Wenn dieses Gerät gespeichert werden soll, muss die Schaltfläche Speichern gedrückt werden.
nb_no: Dette kameraet er åpent som forhåndsvisning. Dette betyr at enheten ikke innlastes neste gang du åpner programmet. Hvis du ønsker å lagre denne enheten, må du klikke "Lagre".
pt: Esta câmera é atualmente apenas aberta como uma pré-visualização. Isso significa que o aparelho não é carregado na próxima vez que abrir esta aplicação. Se quiser gravar este aparelho, então precisa clicar no botão gravar.
tr: Bu kamera şu anda yalnızca ön izleme olarak açılıyor. Bu, bu uygulamayı bir sonraki açışınızda aygıtın yüklü olmayacağı anlamına gelir. Bu aygıtı kaydetmek istiyorsanız, Kaydet düğmesine tıklamanız gerekir.

source: An error occurred during communication with the camera. Technical details: %1
de: Bei der Kommunikation mit der Kamera ist ein Fehler aufgetreten. Technische Details: %1
nb_no: En feil inntraff under kommunikasjon med kameraet. Tekniske detaljer: %1
pt: Ocorreu um erro durante a comunicação com a câmara. Detalhes técnicos: %1
tr: Kamera ile iletişim sırasında bir hata oluştu. Teknik ayrıntılar: %1

source: Discover camera
de: Kamera entdecken
nb_no: Oppdag kamera
pt: Procurar câmera
tr: Kamera bul

source: No camera discovered in the local network.
de: Keine Kamera im lokalen Netzwerk gefunden.
nb_no: Ingen kamera oppdaget i lokalnettverk.
pt: Nenhuma câmera foi descoberta localmente em sua rede.
tr: Yerel ağda kamera bulunamadı.

source: Click on a discovered camera to add it:
de: Klicken Sie auf eine entdeckte Kamera, um sie hinzuzufügen:
nb_no: Klikk på et oppdaget kamera for å legge det til:
pt: Clique numa câmara que descobriu para adicioná la:
tr: Eklemek için bulunan kameranın üzerine tıklayın:

source: Loading…
de: Wird geladen …
nb_no: Laster…
pt: Carregando…
tr: Yükleniyor…

source: Overview
de: Übersicht
nb_no: Oversikt
pt: Visão geral
tr: Genel görünüm

# adds a new camera
source: Add
de: Hinzufügen
nb_no: Legg til
pt: Adicionar
tr: Ekle

# opens the "About" menu
source: About
de: Über
nb_no: Om
pt: Sobre
tr: Hakkında

source: Automaticly discover camera
de: Automatische Erkennung der Kamera
nb_no: Oppdag kamera automatisk
pt: Descobrir automaticamente câmeras
tr: Kamerayı otomatik olarak bul

source: Automatically find a camera in your network.
de: Findet automatisch eine Kamera in Ihrem Netzwerk.
nb_no: Finn et kamera i nettverket ditt automatisk.
pt: Encontrar automaticamente uma câmera em sua rede.
tr: Ağınızda otomatik olarak bir kamera bulun.

source: Add demonstration camera
de: Demonstrationskamera hinzufügen
pt: Adicionar câmara de demonstração
tr: Tanıtım kamerası ekle

source: These demonstration cameras show you some on the capabilities, without owning a camera.
de: Diese Demonstrationskameras zeigen Ihnen einige der Möglichkeiten, ohne eine Kamera zu besitzen.
pt: Essas câmaras de demonstração mostram-lhe algumas das capacidades, sem possuir uma câmara.
tr: Bu tanıtım kameraları, bir kameraya sahip olmadan size bazı özellikleri gösterir.

source: Manually add camera
de: Manuell Kamera hinzufügen
nb_no: Legg til kamera manuelt
pt: Adicionar manualmente uma câmera
tr: El ile kamera ekle

source: Manually adding a camera means that you need to provide the connection parameters yourself.
de: Manuell eine Kamera hinzuzufügen bedeutet, dass die Verbindungsparameter per Hand eingegeben werden müssen.
nb_no: Å legge til et kamera manuelt betyr at du vil måtte angi tilkoblingsparameterne selv.
pt: Adicionar manualmente uma câmara significa que precisa fornecer os parâmetros de conexão.
tr: El ile kamera eklemek, bağlantı parametrelerini kendiniz sağlamanız gerektiği anlamına gelir.

source: You can add a camera by clicking the "Add" button below.
de: Eine Kamera kann hinzugefügt werden, indem unten auf die Schaltfläche „Hinzufügen“ geklickt wird.
nb_no: Du kan legge til et kamera ved å trykke "Legg til"-knappen nedenfor.
pt: Pode adicionar uma câmara clicando no botão "Adicionar" abaixo.
tr: Aşağıdaki "Ekle" düğmesine tıklayarak bir kamera ekleyebilirsiniz.

source: An error occurred during communication with the camera.
de: Bei der Kommunikation mit der Kamera ist ein Fehler aufgetreten.
nb_no: En feil inntraff under kommunikasjon med kameraet.
pt: Ocorreu um erro durante a comunicação com a câmera.
tr: Kamera ile iletişim sırasında bir hata oluştu.

source: The camera doesn't support the retrieval of snapshots.
de: Die Kamera unterstützt den Abruf von Schnappschüssen nicht.
nb_no: Kameraet har ikke støtte for å hente skjermavbildninger.
pt: A câmera não suporta a recuperação de instantâneos.
tr: Kamera, anlık görüntülerin alınmasını desteklemiyor.

# Go to view a camera
source: View
de: Ansehen
nb_no: Vis
pt: Visão
tr: Görüntüle

# Go to settings of a camera
source: Settings
de: Einstellungen
nb_no: Innstillinger
pt: Configurações
tr: Ayarlar

source: Use this open-source app to view your network cameras using the ONVIF protocol.
de: Diese quelloffenen App ermöglicht das Anschauen der eigenen Netzwerkkameras mittels ONVIF-Protokoll.
nb_no: Bruk dette friprogprogrammet for å vise dine nettverkskamera som bruker ONVIF-protokollen.
pt: Use esta app open-source para visualizar as suas câmaras de rede a usar o protocolo ONVIF.
tr: ONVIF protokolünü kullanarak ağ kameralarınızı görüntülemek için bu açık kaynaklı uygulamayı kullanın.

source: The development of this app was started as part of the ONVIF Spotlight Challenge.
de: Die Entwicklung dieser App wurde als Teil der ONVIF Spotlight Challenge gestartet.
nb_no: Utviklingen av dette programmet ble startet som del av ONVIF Spotlight-utfordringen.
pt: O desenvolvimento desta app foi iniciado como parte do ONVIF Spotlight Desafio.
tr: Bu uygulamanın geliştirilmesine ONVIF Spotlight Challenge'ın bir parçası olarak başlandı.

source: You can connect to your network camera and view the video of it. If the camera is controllable you can move it as well.
de: Die eigene Kamera anschließen und deren Video ansehen. Sollte die Kamera steuerbar sein, lässt sie sich auch bewegen.
nb_no: Du kan koble til ditt nettverkskamera og vise videostrømmen fra det. Hvis kameraet er kontrollerbart kan du bevege det også.
pt: Pode conectar-se à sua câmara de rede e ver o vídeo dela. Se a a câmara é controlável, pode movê-la também.
tr: Ağ kameranıza bağlanabilir ve videosunu görüntüleyebilirsiniz. Kamera denetlenebilir ise, onu hareket de ettirebilirsiniz.

source: The camera overview page
de: Die Seite der Kameraübersicht
nb_no: Kameraoversiktssiden
pt: A página de visão geral da câmera
tr: Kameraya genel bakış sayfası

source: The camera settings page
de: Die Seite der Kameraeinstellungen
nb_no: Kamerainnstillingssiden
pt: A página de configurações da câmera
tr: Kamera ayarları sayfası

source: This is a minor release, with the following changes:
de: Dies ist eine Zwischenversion mit den folgenden Änderungen:
pt: Este é um lançamento menor, com as seguintes alterações:
tr: Bu, aşağıdaki değişiklikleri içeren küçük bir sürümdür:

source: Some small improvements
de: Einige kleine Verbesserungen
nb_no: Noen mindre forbedringer
pt: Algumas pequenas melhorias
tr: Bazı küçük iyileştirmeler

source: Now requires Qt 5.12
de: Benötigt jetzt Qt 5.12
nb_no: Krever nå Qt 5.12
pt: Agora requer o Qt 5.12
tr: Artık Qt 5.12 gerektiriyor

source: Removed option for including breeze icons in the binary, however is it configured as fallback theme
de: Die Option zum Einfügen von Breeze-Symbolen in die Datei wurde entfernt, ist jedoch als Fallback-Thema konfiguriert
nb_no: Fjernet alternativ for bruk av bris-ikoner i binærfilen, dog er det satt opp som tilbakefallsdrakt
pt: Opção removida para incluir ícones de brisa no binário, no entanto, é configurado como tema de recuo
tr: Breeze simgelerini ikili dosyaya dahil etme seçeneği kaldırıldı, ancak yedek tema olarak yapılandırıldı

source: This is a minor release, with the following improvements:
de: Dies ist ein neue Unterversion mit folgenden Verbesserungen:
nb_no: Dette er en mindre utgivelse, med følgende forbedringer:
pt: Esta é uma versão menor, com os seguintes aprimoramentos:
tr: Bu, aşağıdaki iyileştirmeleri içeren küçük bir sürümdür:

source: Added support for camera discovery
de: Unterstützung für Kamera-Ermittlung
nb_no: Tillagt støtte for kameraoppdagelse
pt: Adicionado suporte para descoberta de câmera
tr: Kamera bulma desteği eklendi

source: Fixed video viewer for Android
de: Videobetrachter für Android behoben
nb_no: Fikset videoviser for Android
pt: Visualizador de vídeo fixo para Android
tr: Android için video görüntüleyici düzeltildi

source: Improved translations
de: Verbesserte Übersetzungen
nb_no: Forbedrede oversettelser
pt: Traduções aprimoradas
tr: Çeviriler iyileştirildi

source: Improved support for older devices
de: Verbesserte Unterstützung für ältere Geräte
nb_no: Forbedret støtte for eldre enheter
pt: Suporte aprimorado para aparelhos mais antigos
tr: Eski aygıtlar için destek iyileştirildi

source: Show multiple cameras if room available
de: Mehrere Kameras anzeigen, wenn Raum verfügbar ist
nb_no: Vis flere kamera hvis det finnes plass
pt: Mostrar várias câmeras, se disponível
tr: Boş yer varsa birden fazla kamera göster

source: Improved translations and added new langagues
de: Verbesserte Übersetzungen und neu hinzugefügte Sprachen
nb_no: Forbedrede oversettelser og nye språk
pt: Traduções aprimoradas e novos idiomas adicionados
tr: Çeviriler iyileştirildi ve yeni diller eklendi

source: Several internal improvements
de: Mehrere interne Verbesserungen
nb_no: Flere interne forbedringer
pt: Várias melhorias internas
tr: Birkaç dahili iyileştirme

source: Fixed a potential crash
de: Potentieller Absturz beseitigt
nb_no: Fikset potensielt kræsj
pt: Corrigido um possível acidente
tr: Olası bir çökme düzeltildi

source: Added donation instructions
de: Spendenanleitung hinzugefügt
nb_no: Donasjonsinstruks lagt til
pt: Adicionado as instruções de doação
tr: Bağış bilgileri eklendi

source: Use breeze icons as fallback theme
de: Breeze-Symbole als Rückfallthema verwenden
nb_no: Bruk bris-ikoner som tilbakefallsdraktpynt
pt: Use os ícones da brisa como tema substituto
tr: Yedek tema olarak breeze simgelerini kullan

source: Added opening cameras by URL
de: Kameras über URL öffnen hinzugefügt
nb_no: Åpning av kameraer kan nå gjøres med nettadresse
pt: Adicionadas câmeras de abertura por URL
tr: URL ile kamera açma eklendi

source: Improved snapshot downloading
de: Verbessertes Herunterladen von Snapshots
nb_no: Forbedret avbildningsnedlasting
pt: Download aprimorado de instantâneos
tr: Anlık görüntü indirme iyileştirildi

source: Improved translations and added Norwegian
de: Verbesserte Übersetzungen und norwegisch hinzugefügt
nb_no: Forbedrede oversettelser og bokmål lagt til
pt: Melhorias na traduções e adicionar suporte a lingua Norueguesa
tr: Çeviriler iyileştirildi ve Norveççe eklendi

source: Improved UI style by using Kirigami cards
de: UI-Anzeige durch Verwendung von Kirigami-Karten verbessert
nb_no: Forbedret grensesnitt ved bruk av Kirigami-kort
pt: Melhor estilo de interface do utilizador usando cartões Kirigami
tr: Kirigami kartları kullanılarak kullanıcı arayüzü tarzı iyileştirildi

source: Improved translations by supporting Weblate
de: Verbesserte Übersetzungen durch Unterstützung von Weblate
nb_no: Forbedrede oversettelser ved å støtte Weblate
pt: Traduções aprimoradas suportando o Weblate
tr: Weblate desteği ile çeviriler iyileştirildi

source: Made demo cameras optional, by moving them to the add camera button
de: Demokameras optional gemacht, durch Verschieben zum Schalter Kamera hinzufügen
nb_no: Demo-kameraer er nå valgfritt, flyttet til "legg til kamera"-knapp
pt: Tornar as câmeras de demonstração opcionais, movendo-as para o botão Adicionar câmera
tr: Demo kameralar, kamera ekle düğmesine taşınarak isteğe bağlı hale getirildi

source: Renamed internal application name. Note: this causes the configuration file to reset
de: Interner Anwendungsname umbenannt. Hinweis: Dies führt zum Zurücksetzen der Konfigurationsdatei
nb_no: Nytt internt programnavn. Merk: Dette tilbakestiller oppsettsfilen
pt: Nome da aplicação interna renomeada. Nota: isso faz com que o ficheiro de configuração seja zerado
tr: Dahili uygulama adı yeniden adlandırıldı. Not: Bu, yapılandırma dosyasının sıfırlanmasına neden olur

source: Added internationalization support with Brazilian and Dutch translations
de: Internationale Unterstützung für brasilianische und niederländische Sprache hinzugefügt
nb_no: Internasjonaliseringsstøtte lagt til, med brasilianske og nederlandske oversettelser
pt: Adicionado suporte de internacionalização com traduções brasileiras e holandesas
tr: Brezilya ve Flemenkçe çevirilerle uluslararasılaştırma desteği eklendi

source: Replaced demo cameras
de: Demo-Kameras ersetzt
nb_no: Erstattet demo-kameraer
pt: Câmeras de demonstração substituídas
tr: Demo kameralar değiştirildi

source: Added workaround for cameras that don't support relative movement properly
de: Zwischenlösung hinzugefügt für Kameras, die relative Bewegungen nicht richtig unterstützen
nb_no: Ny formålstjenlig måte å få kameraer som ikke støtter relativ bevegelse til å virke
pt: Solução alternativa adicionada para câmeras que não suportam o movimento relativo corretamente
tr: Göreceli hareketi düzgün bir şekilde desteklemeyen kameralar için geçici çözüm eklendi

source: Added support for zoom'ing
de: Unterstützung für Zoomen hinzugefügt
nb_no: Støtte for forstørrelse
pt: Adicionado suporte para zoom'ing
tr: Yakınlaştırma desteği eklendi

source: Improved build system
de: Erstellungssystem verbessert
nb_no: Forbedret byggsystem
pt: Melhoria no sistema de construção
tr: Derleme sistemi iyileştirildi

source: Model:
de: Modell:
nb_no: Modell:
pt: Modelo:
